In [1]:
import pandas as pd

In [2]:
men2004_det = pd.read_csv('../../Data/men2004_det.csv')
men2008_det = pd.read_csv('../../Data/men2008_det.csv')

In [4]:
men2004_det

                  Athlete   Medal  Count
0          BOVELL, George  Bronze      1
1     BREMBILLA, Emiliano  Bronze      1
2   CAPPELLAZZO, Federico  Bronze      1
3         CERCATO, Simone  Bronze      1
4            CONRAD, Lars  Silver      1
..                    ...     ...    ...
72         WOODWARD, Gabe  Bronze      1
73      YAMAMOTO, Takashi  Bronze      1
74      YAMAMOTO, Takashi  Silver      1
75         ZASTROW, Mitja  Silver      1
76    ZWERING, Klaas-Erik  Silver      1

[77 rows x 3 columns]

In [5]:
men2008_det

                  Athlete   Medal  Count
0          ADRIAN, Nathan    Gold      1
1           BERENS, Ricky    Gold      1
2          BERNARD, Alain  Bronze      1
3          BERNARD, Alain    Gold      1
4          BERNARD, Alain  Silver      1
..                    ...     ...    ...
72     VYATCHANIN, Arkady  Bronze      2
73         WALTERS, David    Gold      1
74    WEBER-GALE, Garrett    Gold      2
75  WILDMAN-TOBRINER, Ben    Gold      1
76             ZHANG, Lin  Silver      1

[77 rows x 3 columns]

In [6]:
men2004_det.loc[men2004_det.Athlete == 'PHELPS, Michael']

            Athlete   Medal  Count
50  PHELPS, Michael  Bronze      2
51  PHELPS, Michael    Gold      6

In [7]:
men2008_det.loc[men2008_det.Athlete == 'PHELPS, Michael']

            Athlete Medal  Count
54  PHELPS, Michael  Gold      8

In [8]:
men0408 = men2004_det.merge(men2008_det, how='outer', on='Athlete', suffixes=['_2004', '_2008'])

## We have a problem here, because we have two columns with the same

In [9]:
men0408.loc[men0408.Athlete == 'PHELPS, Michael']

            Athlete Medal_2004  Count_2004 Medal_2008  Count_2008
95  PHELPS, Michael     Bronze         2.0       Gold         8.0
96  PHELPS, Michael       Gold         6.0       Gold         8.0

## We have to merge the dataframes using the Athlete and Medal columns. We what to 2 rows, one for bronze and one for gold.

In [10]:
men0408 = men2004_det.merge(men2008_det, how='outer', on=['Athlete', 'Medal'], suffixes=['_2004', '_2008'])

In [11]:
men0408.loc[men0408.Athlete == 'PHELPS, Michael']

            Athlete   Medal  Count_2004  Count_2008
92  PHELPS, Michael  Bronze         2.0         NaN
93  PHELPS, Michael    Gold         6.0         8.0

# OR we can use pd.merge()

In [12]:
pd.merge(men2004_det, men2008_det, how='outer', on=['Athlete', 'Medal'], suffixes=['_2004', '_2008'])

                 Athlete   Medal  Count_2004  Count_2008
0         ADRIAN, Nathan    Gold         NaN         1.0
1          BERENS, Ricky    Gold         NaN         1.0
2         BERNARD, Alain  Bronze         NaN         1.0
3         BERNARD, Alain    Gold         NaN         1.0
4         BERNARD, Alain  Silver         NaN         1.0
..                   ...     ...         ...         ...
135    YAMAMOTO, Takashi  Bronze         1.0         NaN
136    YAMAMOTO, Takashi  Silver         1.0         NaN
137       ZASTROW, Mitja  Silver         1.0         NaN
138           ZHANG, Lin  Silver         NaN         1.0
139  ZWERING, Klaas-Erik  Silver         1.0         NaN

[140 rows x 4 columns]